Revit 2027 API
StructuralConnectionHandlerType.CreateDefaultStructuralConnectionHandlerType Method
 Creates a new StructuralConnectionHandlerType object with a default name.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ElementId CreateDefaultStructuralConnectionHandlerType(
	Document pADoc
)
Public Shared Function CreateDefaultStructuralConnectionHandlerType (
	pADoc As Document
) As ElementId
public:
static ElementId^ CreateDefaultStructuralConnectionHandlerType(
	Document^ pADoc
)
static member CreateDefaultStructuralConnectionHandlerType :
        pADoc : Document -> ElementId
Parameters
pADoc Document
 The document.
Return Value
ElementId
 The newly created type id.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
ModificationOutsideTransactionException |  The document has no open transaction.
See Also
Reference
StructuralConnectionHandlerType Class
Autodesk.Revit.DB.Structure Namespace